src/Catalogs/НСИРеквизитыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НСИРеквизитыОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.НСИОбъектыДляКонтроля</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеВСистемеКонтролере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаКонтролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИРежимыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаСведений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИТипыРеквизитовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаСведенийВСистемеКонтролере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСсылочногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИОбъектыДляКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируетсяДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКлючаПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляВКонтролере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылочногоОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИОбъектыДляКонтроля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДляКонтроля</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СистемыДляОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Система</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СопутствующиеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИРеквизитыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/НСИТипыРеквизитовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НСИТипыРеквизитовОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/НСИТипыЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НСИТипыЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрыСведений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/НСИРеквизитыОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ТипОбъектаСведений_Простой()
	Возврат Объект.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой;
КонецФункции

&НаСервере
Функция ТипОбъектаСведений_Сведения()
	Возврат Объект.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения;
КонецФункции

&НаСервере
Функция ТипЗначенияРеквизита_Простой()
	Возврат Объект.ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Простой;
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	Видимость = Не ТипОбъектаСведений_Простой();
	Элементы.ГруппаСоставКлючаПоиска.Видимость = Видимость;
	Элементы.ГруппаТип.Видимость = Видимость;
	
	Элементы.КонтролируетсяДокументом.Видимость = ТипОбъектаСведений_Сведения();
	Элементы.ТипСсылочногоОбъекта.Видимость = Не ТипЗначенияРеквизита_Простой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаСведенийПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияРеквизитаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоставКлючаПоиска()
	НайденныеСтроки = Объект.СоставКлючаПоиска.НайтиСтроки(Новый Структура("ОбъектДляКонтроля", Истина));
	Если НайденныеСтроки.Количество() >= 2 Тогда
		Сообщить("В табличной части ""Состав ключа поиска"" должен быть выбран только 1 объект для контроя");
		Отказ = Истина;
	ИначеЕсли Объект.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения И НайденныеСтроки.Количество() = 1 Тогда
		Если НайденныеСтроки[0].ТипСсылочногоОбъекта <> Объект.Владелец Тогда
			Сообщить("Тип ссылочного объекта сведений должен совпадать с владельцем");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьСоставКлючаПоиска();
КонецПроцедуры

&НаСервере
Процедура УстановитьОбъектДляКонтроля(НомерСтроки)
	Для Каждого стр Из Объект.СоставКлючаПоиска Цикл 
		стр.ОбъектДляКонтроля = (стр.НомерСтроки = НомерСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоставКлючаПоискаОбъектДляКонтроляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКлючаПоиска.ТекущиеДанные;
	
	Если ТекущиеДанные.ОбъектДляКонтроля = Истина Тогда
		УстановитьОбъектДляКонтроля(ТекущиеДанные.НомерСтроки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеВладельца()
	Возврат Объект.Владелец.Наименование;
КонецФункции

&НаСервере
Процедура ЗаполнитьСоставКлючаПоискаИзСтроки(СКП)
	Если ЗначениеЗаполнено(СКП) Тогда
		ТЗ = ЗначениеИзСтрокиВнутр(СКП);
		Объект.СоставКлючаПоиска.Загрузить(ТЗ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура ("Владелец", ПолучитьНаименованиеВладельца());
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаВыбораРеквизита = ПолучитьФорму("Справочник.НСИРеквизитыОбъектов.Форма.ФормаВыбораРеквизитаОбъектаМетаданных", ПараметрыФормы);
		Результат = ФормавыбораРеквизита.ОткрытьМодально();
		НаименованиеНачалоВыбораЗавершение(Результат, Неопределено);
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		ОткрытьФорму("Справочник.НСИРеквизитыОбъектов.Форма.ФормаВыбораРеквизитаОбъектаМетаданных", ПараметрыФормы,,,,, Новый ОписаниеОповещения("НаименованиеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Не Результат = Неопределено И Не Результат = КодВозвратаДиалога.Отмена Тогда
        
        ЗаполнитьЗначенияСвойств(Объект, Результат);
        Объект.НаименованиеВСистемеКонтролере = Объект.Наименование;
        Объект.НаименованиеОбъектаСведенийВСистемеКонтролере = Объект.НаименованиеОбъектаСведений;
        
        Если Не ТипОбъектаСведений_Простой() И Не ЗначениеЗаполнено(Объект.ТипСсылочногоОбъекта) Тогда
            Сообщить("Необходимо зарегистрировать новый объект для контроля");
        КонецЕсли;
        
        ЗаполнитьСоставКлючаПоискаИзСтроки(Результат.СКП);
        
        ОбновитьВидимостьЭлементов();
        
        ЭтаФорма.Модифицированность = Истина;
        
    КонецЕсли;

КонецПроцедуры
